Vue.component('guangxi-bank',{
  template:`
    <div>
      <h3 class="text-center">广西集中代收付系统个人授权协议</h3>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;鉴于：广西烟草零售户（以下称“零售户”）与北京中维合众商业管理有限责任公司（委托单位）（以下简称“北京中维”）签署了《卷烟零售户公益票代销协议》（以下简称“《代销协议》”），约定零售户将按《代销协议》之约定销售福利彩票。本委托付款协议（以下简称“本协议”）是零售户与北京中维就《代销协议》约定的福利彩票销售所涉及的委托付款服务的使用等相关事项所订立的有效合约。零售户通过网络页面点击确定或以其他方式选择接受本协议，即表示零售户与北京中维已达成协议并同意接受本协议的全部约定内容。在接受本协议之前，请零售户仔细阅读本协议的全部内容，尤其是加粗加下划线部分的内容。如果零售户不同意本协议的任意内容，或者无法准确理解本协议的各项条款，请不要进行后续操作。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;甲乙双方本着自愿、平等的原则，达成以下委托付款协议：</p>

      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;委托类型：■授权   □变更   □终止  （在□中做选择）</p>
     
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;原协议号（仅“变更”和“终止”时回显）：</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1.零售户委托北京中维通过广西金融电子结算服务中心提供的广西集中代收付系统办理《代销协议》项下彩票销售款项的收取，并授权零售户开户银行按照北京中维向广西集中代收付系统提交的收款信息，从零售户指定账户（账户信息为注册绑定的银行卡信息简称“零售户付款账户”）向北京中维支付款项。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2.零售户保证办理此授权或终止此授权时提供的身份信息真实有效。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;3.零售户应保证零售户付款账户有足够的余额以支付款项，如零售户账户余额不足以全额支付款项的，零售户同意按当前余额进行部分付款。</p>
   
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;4.因零售户付款账户挂失、冻结、销户或余额不足等原因，未能支付相关应付款项所造成的一切损失和法律后果由零售户承担。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;5.零售户需要变更零售户付款账户时，应及时与北京中维在线（此处的在线是指：【北京中维APP】）签署《广西集中代收付系统个人授权协议》（变更）（以下简称为“《变更协议》”），《变更协议》提交广西集中代收付系统生效后，原协议自动终止。因零售户未及时签署《变更协议》所造成的一切违约责任和法律后果均由零售户承担。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;6.零售户有权向北京中维提出终止授权，零售户终止授权时，应与北京中维在线签订《广西集中代收付系统个人授权协议》（终止）。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;7.零售户与北京中维保证本协议及后续在线操作中所填信息真实、有效、完整。因一方信息填写有误，未能按付款信息成功扣除相关应付款项所造成的损失由责任方承担。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8.北京中维应负责审核本协议信息，确保其准确无误，及时将本协议（包括“授权”、“变更”和“终止”）的电子信息提交到广西集中代收付系统，因未及时提交协议电子信息造成的责任由北京中维承担。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;9.零售户开户银行按照北京中维向广西集中代收付系统发送的付款信息进行付款后，即视为零售户对付款金额、付款次数无异议，如出现付款金额与发票金额不符问题，由零售户和北京中维双方协商解决。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;10.因不可抗力导致零售户和北京中维双方遭受损失的，双方均不承担责任。不可抗力包括但不限于：自然灾害、突发性公共安全事件、突发性公共卫生事件、国家或监管部门强制性要求、战争。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;11. 零售户和北京中维双方执行本协议过程中发生争议的，应协商解决；协商不成的，双方同意将争议提交北京中维所在地的人民法院通过诉讼解决。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;12.对于委托类型为“变更”和“终止”的协议应注明原协议号。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;13.本协议未作约定的部分，均遵守我国有关法律、法规以及集中代收付系统的有关制度执行。</p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;14.未尽事宜，零售户和北京中维双方可另行签订补充协议，补充协议为本协议不可分割的部分，具有同等的法律效力。</p>
  </div>

  `
})